Repository: immatt-0/lenbrary
Catalog: frontend/lib/l10n/app_*.arb
Languages: ro

source: Approved requests
ro: Cereri aprobate

source: Added books
ro: Cărți adăugate

source: Updated books
ro: Cărți actualizate

source: Deleted books
ro: Cărți șterse

source: Messages
ro: Mesaje

source: Other notifications
ro: Alte notificări

# requestApprovedSuccess
source: Request approved successfully!
ro: Cerere aprobată cu succes!

# requestRejectedSuccess
source: Request rejected successfully!
ro: Cerere respinsă cu succes!

# bookRequestsTitle
source: Book Requests
ro: Cereri Cărți

# bookManualsRequestsTitle
source: Book and Manual Requests
ro: Cereri de Cărți și Manuale

# searchPlaceholder
source: 🔍 Search...
ro: 🔍 Caută...

# searchDetailedPlaceholder
source: 🔍 Search by book name or student name...
ro: 🔍 Caută după numele cărții sau studentului...

source: No pending requests
ro: Nu există cereri în așteptare

source: No approved requests
ro: Nu există cereri aprobate

source: No requests need approval
ro: Nu există cereri care necesită aprobare

# noApprovedRequestsCurrently
source: No approved requests at the moment
ro: Nu există cereri aprobate în acest moment

# dueDateLabel
source: Due date:
ro: Data scadenței:

# loanDurationLabel
source: Loan duration:
ro: Durată împrumut:

source: Mark as picked up
ro: Marchează ca ridicat

# bookMarkedAsPickedUp
source: The book/manual has been marked as picked up!
ro: Cartea/manualul a fost marcat ca ridicat!

# markingPickedUp
source: Mark Picked Up
ro: Marcare Ridicată

# searchBookStudentPlaceholder
source: Search by book name or student name...
ro: Caută după numele cărții sau studentului...

source: To Pickup
ro: De ridicat

source: No pickup requests
ro: Nu există cereri de ridicat

source: Approved at
ro: Aprobat la

source: Due at
ro: Scadentă la

source: Borrowed at
ro: Împrumutat la

source: Loan
ro: Împrumut

source: Unknown user
ro: Utilizator necunoscut

# classLabel2
source: Class
ro: Clasă

# schoolTypeGenerala
source: Middle School
ro: Generala

# schoolTypeLiceu
source: High School
ro: Liceu

# pleaseEnterPassword
source: Please enter a password
ro: Vă rugăm să introduceți o parolă

# passwordNoSpaces
source: Password cannot contain spaces
ro: Parola nu poate conține spații

# passwordNeedsUppercase
source: Password must contain at least one uppercase letter
ro: Parola trebuie să conțină cel puțin o literă mare

# passwordNeedsNumber
source: Password must contain at least one number
ro: Parola trebuie să conțină cel puțin o cifră

# passwordNeedsSpecialChar
source: Password must contain at least one special character
ro: Parola trebuie să conțină cel puțin un caracter special

# pleaseConfirmPassword
source: Please confirm the password
ro: Vă rugăm să confirmați parola

source: Passwords do not match
ro: Parolele nu se potrivesc

# emailMustBeNlenau
source: Email must be from the nlenau.ro domain
ro: Email-ul trebuie să fie din domeniul nlenau.ro

source: Please select school type
ro: Vă rugăm să selectați tipul de școală

source: Please select profile
ro: Vă rugăm să selectați profilul

source: Please select class letter
ro: Vă rugăm să selectați litera clasei

source: Please enter invitation code
ro: Vă rugăm să introduceți codul de invitație

# registrationError
source: Registration error. Please try again.
ro: Eroare la înregistrare. Vă rugăm să încercați din nou.

# registrationSuccess
source: Registration successful! Check your inbox to activate your account.
ro: Înregistrare reușită! Verifică inboxul pentru a-ți activa contul.

# searchBooksTitle
source: Search Books
ro: Căutare Cărți

source: Select loan duration
ro: Selectează durata împrumutului

# bookRequestError
source: Error requesting book/manual: {error}
ro: Eroare la solicitarea cărții/manualului: {error}

# loadBooksError
source: Error loading books: {error}
ro: Eroare la încărcarea cărților: {error}

# noBooksAvailable
source: No books/manuals available.
ro: Nu există cărți/manuale.

# displayError
source: Display error: {error}
ro: Eroare la afișare: {error}

source: Invalid book
ro: Carte invalidă

source: No category
ro: Fără categorie

# bookDisplayError
source: Error displaying book
ro: Eroare la afișarea cărții

source: App Settings
ro: Setări aplicație

source: App Theme
ro: Temă aplicație

# lightThemeActive
source: Light theme activated
ro: Tema deschisă activată

# darkThemeActive
source: Dark theme activated
ro: Tema întunecată activată

source: App Language
ro: Limba aplicației

# languageChangedSuccess
source: Language changed successfully
ro: Limba a fost schimbată cu succes

# themeDescription
source: Switch between light and dark theme
ro: Comută între tema deschisă și cea întunecată

source: Library Management System
ro: Sistem de gestionare bibliotecă

# welcomeLibrarian
source: Welcome, Mrs. Librarian!
ro: Bun venit, doamna Bibliotecară!

# viewManageRequests
source: View and manage your requests
ro: Vizualizează și gestionează cererile tale

# findExamModels
source: Find test models for studying
ro: Găsește modele de teste pentru studiu

# editDeleteBooks
source: Edit and delete books from catalog
ro: Editează și șterge cărți din catalog

source: Manage loan requests
ro: Gestionează cererile de împrumut

source: View current loans
ro: Vizualizează împrumuturile curente

source: View loan history
ro: Vizualizează istoricul împrumuturilor

# manageExamModels
source: Manage test models
ro: Gestionează modelele de teste

# exploreCatalog
source: Explore library catalog
ro: Explorează catalogul bibliotecii

# generateTeacherCodes
source: Generate registration codes for teachers
ro: Generează coduri de înregistrare pentru profesori

source: Teacher codes
ro: Coduri pentru profesori

source: About teacher codes
ro: Despre codurile pentru profesori

# teacherCodeDescription
source: Generated codes are used by teachers to register in the system. Each code can be used only once and expires after 6 hours.
ro: Codurile generate sunt folosite de profesori pentru a se înregistra în sistem. Fiecare cod poate fi folosit o singură dată și expiră după 6 ore.

source: Generate new code
ro: Generează cod nou

source: Generating...
ro: Se generează...

# codeGeneratedSuccess
source: Code generated successfully!
ro: Cod generat cu succes!

source: Copy code
ro: Copiază codul

source: Existing codes
ro: Coduri existente

source: No codes generated
ro: Nu există coduri generate

# generateFirstCode
source: Generate the first code for teachers
ro: Generează primul cod pentru profesori

# codeAvailable
source: Available
ro: Disponibil

# codeExpired
source: Expired
ro: Expirat

# createdAt
source: Created: {date}
ro: Creat: {date}

# expiresAt
source: Expires: {date}
ro: Expiră: {date}

source: Delete code
ro: Șterge codul

source: Delete confirmation
ro: Confirmare ștergere

# deleteCodeConfirmText
source: Are you sure you want to delete this code? This action cannot be undone.
ro: Ești sigur că vrei să ștergi acest cod? Această acțiune nu poate fi anulată.

# loadCodesError
source: Error loading codes: {error}
ro: Eroare la încărcarea codurilor: {error}

# generateCodeError
source: Error generating code: {error}
ro: Eroare la generarea codului: {error}

# copyCodeSuccess
source: Code copied to clipboard!
ro: Cod copiat în clipboard!

# deleteCodeSuccess
source: Code deleted successfully!
ro: Cod șters cu succes!

# deleteCodeError
source: Error deleting code: {error}
ro: Eroare la ștergerea codului: {error}

source: Switch to Light Mode
ro: Comută la tema luminoasă

source: Switch to Dark Mode
ro: Comută la tema întunecată

source: Settings Menu
ro: Meniu setări
