Repository: immatt-0/lenbrary
Catalog: frontend/lib/l10n/app_*.arb
Languages: ro

source: Dashboard
ro: Tablou de Bord

source: Books
ro: Cărți

source: Teacher
ro: Profesor

source: My requests
ro: Cererile mele

source: Notifications
ro: Notificări

source: Settings
ro: Setări

source: Profile
ro: Profil

source: Logout
ro: Deconectare

source: Login
ro: Conectare

# stockCannotExceedInventory
source: Stock cannot be greater than inventory
ro: Stocul nu poate fi mai mare decât inventarul

# uploadManualPdfFile
source: Upload the manual PDF file
ro: Încarcă fișierul PDF al manualului

# pdfFileSize
source: PDF file ({size} KB)
ro: Fișier PDF ({size} KB)

source: PDF file selected
ro: Fișier PDF selectat

source: Tap to change
ro: Apasă pentru a schimba

source: Upload PDF file
ro: Încarcă fișier PDF

# selectManualPdfFile
source: Select the manual PDF file
ro: Selectează fișierul PDF al manualului

source: Tap to upload
ro: Apasă pentru a încărca

source: Add {item}
ro: Adaugă {item}

source: Password
ro: Parolă

source: Confirm Password
ro: Confirmă Parola

source: Register
ro: Înregistrare

source: Forgot Password?
ro: Ai uitat parola?

source: Username or Email
ro: Username sau Email

# enterUsernameOrEmail
source: Please enter your username or email address
ro: Vă rugăm să introduceți username-ul sau adresa de email

# enterPassword
source: Please enter your password
ro: Vă rugăm să introduceți parola

source: Authentication
ro: Autentificare

# noAccountRegister
source: Don't have an account? Register
ro: Nu ai cont? Înregistrează-te

source: First Name
ro: Prenume

source: Last Name
ro: Nume

# enterFirstName
source: Please enter your first name
ro: Vă rugăm să introduceți prenumele

# enterLastName
source: Please enter your last name
ro: Vă rugăm să introduceți numele

# enterEmail
source: Please enter your email address
ro: Vă rugăm să introduceți adresa de email

source: School Type
ro: Tip Școală

# selectSchoolType
source: Please select a school type
ro: Vă rugăm să selectați tipul de școală

# classLevel
source: Class
ro: Clasă

source: Select Class
ro: Selectează Clasa

# selectProfile
source: Please select a profile
ro: Vă rugăm să selectați profilul

source: Class Letter
ro: Litera clasei

# selectClassLetter
source: Please select a class letter
ro: Vă rugăm să selectați litera clasei

source: Invitation Code
ro: Cod de invitație

# enterInvitationCode
source: Please enter the invitation code
ro: Vă rugăm să introduceți codul de invitație

# alreadyHaveAccount
source: Already have an account? Login
ro: Ai deja un cont? Autentifică-te

source: Create Account
ro: Creează cont

source: Creating account...
ro: Se creează contul...

# registrationTitle
source: Create your account
ro: Creează-ți contul

# registrationSubtitle
source: Fill in the details to register
ro: Completează detaliile pentru a te înregistra

source: Loading...
ro: Se încarcă...

source: Welcome
ro: Bine ai venit

source: Welcome back
ro: Bine ai revenit

source: Search books
ro: Caută cărți

source: Request Book
ro: Solicită Cartea

source: Dark Mode
ro: Mod Întunecat

source: Light Mode
ro: Mod Luminos

source: Theme
ro: Temă

source: Language
ro: Limbă

source: Book added
ro: Carte adăugată

# requestSent
source: Request sent successfully!
ro: Cererea a fost trimisă cu succes!

# requestFailed
source: Failed to send request
ro: Trimiterea cererii a eșuat

source: Retry
ro: Încearcă din nou

# noResults
source: No results found
ro: Nu s-au găsit rezultate

# noResultsFor
source: No results found for "{query}"
ro: Nu s-au găsit rezultate pentru "{query}"

source: No active loans
ro: Nu există împrumuturi active

# selectDuration
source: Select loan duration
ro: Selectează durata împrumutului

# oneWeek
source: 1 Week
ro: 1 Săptămână

# twoWeeks
source: 2 Weeks
ro: 2 Săptămâni

# oneMonth
source: 1 Month
ro: 1 Lună

# twoMonths
source: 2 Months
ro: 2 Luni

source: Loans
ro: Împrumuturi

source: Active loans
ro: Împrumuturi active

source: Loading loans...
ro: Se încarcă împrumuturile...

source: Loan history
ro: Istoric împrumuturi

# pickupAndLoans
source: Pickup & Loans
ro: Ridicare & Împrumuturi

source: Manage books
ro: Gestionează cărți

source: Add book
ro: Adaugă carte

source: Edit Book
ro: Editează Carte

source: Delete Book
ro: Șterge Carte

source: Book Details
ro: Detalii Carte

source: Add Cover
ro: Adaugă Copertă

source: Take Picture
ro: Fă o poză

source: Add from Gallery
ro: Adaugă din Galerie

source: Add PDF
ro: Adaugă PDF

source: Choose PDF File
ro: Alege Fișier PDF

source: Resource Type
ro: Tip Resursă

source: required
ro: obligatoriu

# basicInfo
source: Basic Information
ro: Informații de bază

source: Additional Details
ro: Detalii suplimentare

# stockInfo
source: Stock Information
ro: Informații stoc

source: Total Inventory
ro: Inventar Total

source: Available Stock
ro: Stoc Disponibil

# fillBookDetails
source: Fill in the details for the new book/manual
ro: Completează detaliile pentru noua carte/manual

# requiredFields
source: Fields marked with * are required
ro: Câmpurile marcate cu * sunt obligatorii

# emailDomainError
source: Email must be from nlenau.ro domain
ro: Email-ul trebuie să fie din domeniul nlenau.ro

# passwordMismatch
source: Passwords do not match
ro: Parolele nu se potrivesc

# passwordMinLength
source: Password must be at least 8 characters long
ro: Parola trebuie să aibă cel puțin 8 caractere

source: Teacher account
ro: Cont de profesor

source: Student information
ro: Informații elev

# accountCreated
source: Account created successfully!
ro: Contul a fost creat cu succes!

source: General School
ro: Generala

source: High School
ro: Liceu

# welcomeUser
source: Welcome, {userName}!
ro: Bun venit, {userName}!

# whatDoYouWantToday
source: What would you like to do today?
ro: Ce doriți să faceți astăzi?

# searchBooksShort
source: Search books and manuals...
ro: Caută cărți și manuale...

# addNewBook
source: Add a new book to catalog
ro: Adaugă o nouă carte în catalog

source: View Requests
ro: Vizualizează Cereri

# examModels
source: Test models
ro: Modele de teste

source: Generate Codes
ro: Generează Coduri

source: Quick Actions
ro: Acțiuni Rapide

source: Please enter
ro: Vă rugăm să introduceți

source: Book
ro: Carte

source: Register as teacher
ro: Înregistrare ca profesor

source: Enter teacher code
ro: Introduceți codul de profesor

source: Back
ro: Înapoi

# chooseCoverMethod
source: Choose how you want to add the book cover:
ro: Alegeți cum doriți să adăugați coperta cărții:

source: Add PDF
ro: Adaugă PDF

# choosePdfMethod
source: Choose how you want to add the PDF:
ro: Alegeți cum doriți să adăugați PDF-ul:

source: Take Photo
ro: Fă poză

source: Select from Gallery
ro: Selectează din galerie

source: Select File
ro: Selectează fișier

source: Title
ro: Titlu

source: Author
ro: Autor

source: Description
ro: Descriere

source: Pages
ro: Pagini

source: Category
ro: Categorie

source: Price
ro: Preț

source: Stock
ro: Stoc

source: Name
ro: Nume

source: Error
ro: Eroare

source: Success
ro: Succes

source: Cancel
ro: Anulează

source: Save
ro: Salvează

source: Delete
ro: Șterge

source: Edit
ro: Editează

source: Add
ro: Adaugă

source: Search
ro: Caută

source: 🔍 Search by book name...
ro: 🔍 Caută după numele cărții...

source: Filter
ro: Filtrează

source: All
ro: Toate

source: Pending
ro: În așteptare

source: Approved
ro: Aprobat

source: Rejected
ro: Respins

source: Borrowed
ro: Împrumutat

source: Returned
ro: Returnat

source: Book Title
ro: Titlul Cărții

source: Publication Year
ro: Anul Publicării

source: Inventory
ro: Inventar

source: Request Duration
ro: Durata Cererii

source: days
ro: zile

source: Message
ro: Mesaj

# noBooks
source: No books available
ro: Nu sunt cărți disponibile

source: No books found
ro: Nu s-au găsit cărți

source: No requests
ro: Nu sunt cereri

source: No notifications
ro: Nu sunt notificări

source: Mark all as read
ro: Marchează toate ca citite

source: Read notifications
ro: Notificări citite

source: Unread notifications
ro: Notificări necitite

source: Select Language
ro: Selectează Limba

source: Romanian
ro: Română

source: English
ro: Engleză

source: German
ro: Germană

# languageChanged
source: Language changed successfully
ro: Limba a fost schimbată cu succes

source: System Mode
ro: Mod Sistem

source: About App
ro: Despre aplicație

source: Version
ro: Versiune

# appDescription
source: A comprehensive digital library management system
ro: Un sistem cuprinzător de management digital pentru biblioteci

source: Back to Home
ro: Înapoi la Acasă

source: optional
ro: opțional

source: Invalid input
ro: Intrare invalidă

# mustBeNumber
source: Must be a number
ro: Trebuie să fie un număr

source: Cannot exceed
ro: Nu poate depăși

source: Unknown book
ro: Carte necunoscută

source: Pickup date:
ro: Data ridicării:

# bookAddedSuccessfully
source: Book/manual has been added successfully!
ro: Cartea/manualul a fost adăugat cu succes!

source: Take a photo
ro: Fă o poză

# gimnaziuV
source: Middle School V
ro: Gimnaziu V

# gimnaziuVI
source: Middle School VI
ro: Gimnaziu VI

# gimnaziuVII
source: Middle School VII
ro: Gimnaziu VII

# gimnaziuVIII
source: Middle School VIII
ro: Gimnaziu VIII

# liceulIX
source: High School IX
ro: Liceu IX

# liceulX
source: High School X
ro: Liceu X

# liceulXI
source: High School XI
ro: Liceu XI

# liceulXII
source: High School XII
ro: Liceu XII

source: Due date:
ro: Data scadenței:

source: Not available
ro: Nu este disponibilă

source: Processing...
ro: Se procesează...

source: Book returned
ro: Carte returnată

source: Book updated
ro: Carte actualizată

source: Book deleted
ro: Carte ștearsă

source: Request approved
ro: Cerere aprobată

# requestRejected
source: Request rejected successfully!
ro: Cererea a fost respinsă cu succes!

# extensionRequested
source: Extension request
ro: Cerere de extindere

source: Extension approved
ro: Extindere aprobată

source: Extension rejected
ro: Extindere respinsă

source: Book Type
ro: Tip Resursă

source: Cover
ro: Copertă

source: Choose PDF file
ro: Alege fișier PDF

# totalCopies
source: Total number of copies
ro: Numărul total de exemplare

# availableCopies
source: Number of copies available for borrowing
ro: Numărul de exemplare disponibile pentru împrumut

source: Pending requests
ro: Cereri în așteptare

source: Extension requests
ro: Cereri de extindere

# extensionRequestDescription
source: Here you can view extension requests
ro: Aici puteți vizualiza cererile de extindere

source: Approve
ro: Aprobă

source: Reject
ro: Respinge

source: Reason
ro: Motiv

source: Approve Request
ro: Aprobă Cererea

source: Reject Request
ro: Respinge Cererea

source: Requested on
ro: Cerută pe

source: Requested by
ro: Cerută de

source: Duration
ro: Durată

source: Extend
ro: Prelungește

source: Extension Reason
ro: Motivul Prelungirii

source: New Duration
ro: Durata Nouă

source: Request Extension
ro: Solicită Prelungire

source: View Details
ro: Vezi Detalii

source: Close
ro: Închide

source: Confirm
ro: Confirmă

# adminPanel
source: Library administration panel
ro: Panou de administrare bibliotecă

source: Manage Users
ro: Gestionează Utilizatorii

source: Manage Requests
ro: Gestionează Cererile

source: Reports
ro: Rapoarte

source: Statistics
ro: Statistici

source: Adding...
ro: Se adaugă...

# errorCameraAccess
source: Error accessing camera
ro: Eroare la accesarea camerei

# errorGalleryAccess
source: Error accessing gallery
ro: Eroare la accesarea galeriei

# errorReadingPdf
source: Error reading PDF file
ro: Eroare la citirea fișierului PDF

# errorAccessingPdf
source: Error accessing PDF file
ro: Eroare la accesarea fișierului PDF

# errorSelectingPdf
source: Error selecting PDF file
ro: Eroare la selectarea fișierului PDF

# choosePdfForManual
source: Choose PDF file for manual:
ro: Alegeți fișierul PDF pentru manual:

source: Please select class
ro: Vă rugăm să selectați clasa

# pleaseEnterTitle
source: Please enter a title
ro: Vă rugăm să introduceți un titlu

# pleaseEnterAuthor
source: Please enter an author
ro: Vă rugăm să introduceți un autor

# pleaseEnterCategory
source: Please enter a category
ro: Vă rugăm să introduceți o categorie

# pleaseEnterDescription
source: Please enter a description
ro: Vă rugăm să introduceți o descriere

# pleaseEnterValidYear
source: Please enter a valid year
ro: Vă rugăm să introduceți un an valid

source: Please enter total inventory
ro: Vă rugăm să introduceți inventarul total

source: Please enter available stock
ro: Vă rugăm să introduceți stocul disponibil

# inventoryMustBeNumber
source: Inventory must be a number
ro: Inventarul trebuie să fie un număr

# stockMustBeNumber
source: Stock must be a number
ro: Stocul trebuie să fie un număr

source: PDF successfully added
ro: PDF selectat cu succes

# pleaseSelectPdfFile
source: Please select a PDF file.
ro: Vă rugăm să selectați un fișier PDF.

# pleaseSelectExamType
source: Please select the exam type.
ro: Vă rugăm să selectați tipul examenului.

# pleaseSelectSubject
source: Please select the subject.
ro: Vă rugăm să selectați materia.

# errorAddingItem
source: Error adding item: {error}
ro: Eroare la adăugare: {error}

source: Add Exam Model
ro: Adaugă Model de Examen

source: New Exam Model
ro: Model de Examen Nou

# fillExamModelDetails
source: Fill in the exam model details
ro: Completează detaliile modelului de examen

source: Exam model name
ro: Nume model examen

# enterExamModelName
source: Enter a name
ro: Introduceți un nume

source: Exam Type
ro: Tip examen

# nationalEvaluation
source: National Evaluation (EN)
ro: Evaluare Națională (EN)

# baccalaureate
source: Baccalaureate (BAC)
ro: Bacalaureat (BAC)

# selectExamTypeValidator
source: Select the exam type
ro: Selectați tipul examenului

source: Subject
ro: Materia

source: Mathematics
ro: Matematică

# selectSubjectValidator
source: Select the subject
ro: Selectați materia

source: Add model
ro: Adaugă modelul

# tapToSelectPdfFile
source: Tap to select a PDF file
ro: Apasă pentru a selecta un fișier PDF

source: Request Loan
ro: Solicită împrumut

source: Loan duration:
ro: Durată împrumut:

source: Message (optional):
ro: Mesaj (opțional):

# writeMessageForLibrarian
source: Write a message for the librarian... (optional)
ro: Scrie un mesaj pentru bibliotecar... (opțional)

# loanRequestSuccess
source: Loan request registered successfully!
ro: Cerere de împrumut înregistrată cu succes!

# errorRequestingBook
source: Error requesting book/manual: {error}
ro: Eroare la solicitarea cărții/manualului: {error}

# classLabel
source: Class {className}
ro: Clasa {className}

# available
source: Available: {count}
ro: Disponibile: {count}

source: Unavailable
ro: Indisponibil

source: Open PDF
ro: Deschide PDF

# pdfOpenError
source: Could not open PDF.
ro: Nu s-a putut deschide PDF-ul.

# pdfOpenErrorDetails
source: Error opening PDF: {error}
ro: Eroare la deschiderea PDF-ului: {error}

source: Sending...
ro: Se trimite...

source: Refresh
ro: Reîmprospătează

source: 🔍 Search exam models...
ro: 🔍 Caută modele de teste...

source: All Types
ro: Toate tipurile

source: All subjects
ro: Toate materiile

source: Math
ro: Mate

# mate
source: Math
ro: Mate

source: Delete model
ro: Șterge model

# examModelsTitle
source: Test Models
ro: Modele de Teste

# searchExamModelsHint
source: Search test models...
ro: Caută modele de teste...

source: Test type
ro: Tip test

# allTestTypes
source: All types
ro: Toate tipurile

source: Model without name
ro: Model fără nume

source: No tests available
ro: Nu există teste disponibile

# noTestsForSearch
source: No tests found for your search
ro: Nu s-au găsit teste pentru căutarea ta

# modelsWillAppear
source: Models will appear here after they are added
ro: Modelele vor apărea aici după ce vor fi adăugate

# modifySearchTerms
source: Try modifying the search terms
ro: Încearcă să modifici termenii de căutare

source: Could not open PDF.
ro: Nu s-a putut deschide PDF-ul.

# extensionRequestsTitle
source: Extension Requests
ro: Cereri de Extindere

# refreshTooltip
source: Refresh
ro: Reîmprospătează

source: Loading requests...
ro: Se încarcă cererile...

source: No extension requests
ro: Nu există cereri de extindere

# extensionRequestsWillAppear
source: Extension requests will appear here
ro: Cererile de extindere vor apărea aici

# alreadyExtendedMessage
source: This book has already been extended once. It cannot be extended again.
ro: Această carte a fost deja prelungită o dată. Nu se poate prelungi din nou.

# fromLabel
source: From:
ro: De la:

# toLabel
source: To:
ro: Până la:

# extensionRequestDetailsTitle
source: Extension request details
ro: Detalii cerere extindere

source: Current return date
ro: Data curentă de returnare

source: Extended return date
ro: Data extinsă de returnare

source: Student message
ro: Mesajul studentului

# extensionApprovedMessage
source: Extension approved successfully!
ro: Extindere aprobată cu succes!

source: Approving...
ro: Se aprobă...

# extensionRejectedMessage
source: Extension rejected successfully!
ro: Extindere respinsă cu succes!

source: Rejecting...
ro: Se respinge...

source: Unknown
ro: Necunoscut

source: Already extended
ro: Deja prelungit

# errorRejecting
source: Error rejecting: {error}
ro: Eroare la respingere: {error}

# addExamModelButton
source: Add exam model
ro: Adaugă model de examen

source: Loading models...
ro: Se încarcă modelele...

# futureSubject
source: We will add {subject} tests in the future
ro: Vom adăuga testele de {subject} în viitor

# noModelsFound
source: No models found for your search
ro: Nu s-au găsit modele pentru căutarea ta

# noModelsExist
source: No exam models exist
ro: Nu există modele de teste

# focusOnMainSubjects
source: Currently we focus on mathematics and Romanian
ro: Momentan ne concentrăm pe matematica și română

# tryModifyingSearch
source: Try modifying the search terms
ro: Încearcă să modifici termenii de căutare

# addFirstModel
source: Add the first exam model
ro: Adaugă primul model de examen

# openPdfTooltip
source: Open PDF
ro: Deschide PDF

# deleteModelTooltip
source: Delete model
ro: Șterge model

# errorLoadingModels
source: Error loading models: {error}
ro: Eroare la încărcarea modelelor: {error}

# errorDeleting
source: Error deleting: {error}
ro: Eroare la ștergere: {error}

# loanHistoryTitle
source: Loan History
ro: Istoric împrumuturi

# recordsCount
source: {count} records
ro: {count} înregistrări

# backTooltip
source: Back
ro: Înapoi

# searchBooksPlaceholder
source: 🔍 Search by name, author or title...
ro: 🔍 Caută după nume, autor sau titlu...

source: Loading history...
ro: Se încarcă istoricul...

# noSearchResults
source: No results found for "{query}"
ro: Nu s-au găsit rezultate pentru "{query}"

# noLoanHistory
source: No loan history exists
ro: Nu există istoric de împrumuturi

# tryModifyingSearchTerms
source: Try modifying the search terms
ro: Încearcă să modifici termenii de căutare

# historyWillAppear
source: History will appear here after loans are made
ro: Istoricul va apărea aici după ce se vor face împrumuturi

source: Not returned yet
ro: Nu s-a returnat încă

source: Cancelled
ro: Anulată

source: Unknown author
ro: Autor necunoscut

source: Request date:
ro: Data cererii:

# loginHintShort
source: first.last
ro: nume.prenume

# loginHintLong
source: first.last or first.last@nlenau.ro
ro: nume.prenume sau nume.prenume@nlenau.ro

# manageBooksShort
source: Manage
ro: Administrare

# manageBooksLong
source: Manage Books
ro: Administrare Cărți

source: Manuals
ro: Manuale

# searchBooksLong
source: Search by title, author, category or class (e.g. VIII or 8)...
ro: Caută după titlu, autor, categorie sau clasă (ex: VIII sau 8)...

# noBookFoundFor
source: No book found for "{query}"
ro: Nicio carte găsită pentru "{query}"

source: No books in library
ro: Nu există cărți în bibliotecă

source: No manuals in library
ro: Nu există manuale în bibliotecă

source: Reload
ro: Reîncarcă

# stockLabel
source: Stock: {current}/{total}
ro: Stoc: {current}/{total}

# noLoanRequests
source: You have no loan requests
ro: Nu aveți cereri de împrumut

# requestsWillAppear
source: Your requests will appear here after you request books
ro: Cererile tale vor apărea aici după ce vei solicita cărți

source: Ready for pickup
ro: Gata de ridicare

source: Overdue
ro: Întârziată

source: Request
ro: Cerere

source: Estimated
ro: Estimat

source: Tap to extend
ro: Apasă pentru prelungire

source: Cancel request
ro: Anulează cererea

# confirmCancelRequest
source: Are you sure you want to cancel this request?
ro: Sigur vrei să anulezi această cerere?

# messageForLibrarian
source: Message for librarian (optional):
ro: Mesaj pentru bibliotecar (opțional):

# addMessage
source: Add a message...
ro: Adaugă un mesaj...

source: Give up
ro: Renunță

# requestCancelledSuccess
source: Request has been cancelled successfully.
ro: Cererea a fost anulată cu succes.

# cancelError
source: Error cancelling: {error}
ro: Eroare la anulare: {error}

source: Extend loan
ro: Prelungire împrumut

source: Extension period:
ro: Perioada de prelungire:

# daysLabel
source: {days} days
ro: {days} zile

source: Submit request
ro: Trimite cererea

# extensionRequestSuccess
source: Extension request has been sent successfully!
ro: Cererea de prelungire a fost trimisă cu succes!

# bookAlreadyExtended
source: This book has already been extended once and cannot be extended again.
ro: Această carte a fost deja prelungită o dată și nu mai poate fi prelungită.

source: Loading notifications...
ro: Se încarcă notificările...

# notificationLoadError
source: Error loading notifications: {error}
ro: Eroare la încărcarea notificărilor: {error}

# markAsReadError
source: Error marking notification as read: {error}
ro: Eroare la marcarea notificării ca citită: {error}

# markAllAsReadError
source: Error marking notifications as read: {error}
ro: Eroare la marcarea notificărilor ca citite: {error}

# allNotificationsMarkedAsRead
source: All notifications have been marked as read
ro: Toate notificările au fost marcate ca citite

source: Date:
ro: Data:

# bookRequested
source: Book request
ro: Cerere de carte

source: Book accepted
ro: Carte acceptată

source: Book rejected
ro: Carte respinsă

source: Request cancelled
ro: Cerere anulată

source: Teacher registered
ro: Profesor înregistrat

source: New message
ro: Mesaj nou

source: Unknown notification
ro: Notificare necunoscută

# notificationWithType
source: Notification ({type})
ro: Notificare ({type})

source: Filter notifications
ro: Filtrează notificările

# showingAllNotifications
source: Showing all notifications ({count})
ro: Se afișează toate notificările ({count})

# activeFilter
source: Active filter: {filterName} ({count})
ro: Filtru activ: {filterName} ({count})

# noNotificationsOfType
source: You have no notifications of this type
ro: Nu ai notificări de acest tip

# allNotificationsWillAppear
source: All your notifications will appear here
ro: Toate notificările tale vor apărea aici

# tryChangingFilter
source: Try changing the filter to see other notifications
ro: Încearcă să schimbi filtrul pentru a vedea alte notificări

source: Read
ro: Citită

# newNotification
source: New
ro: Nouă

source: Now
ro: Acum

# minutesAgo
source: {minutes}m ago
ro: {minutes}m în urmă

# hoursAgo
source: {hours}h ago
ro: {hours}h în urmă

# daysAgo
source: {days}d ago
ro: {days}z în urmă

source: All notifications
ro: Toate notificările

source: Registered teachers
ro: Profesori înregistrați

source: Book requests
ro: Cereri de cărți

source: Accepted books
ro: Cărți acceptate

source: Rejected books
ro: Cărți respinse

source: Returned books
ro: Cărți returnate

source: Approved extensions
ro: Extinderi aprobate

source: Rejected extensions
ro: Extinderi respinse

source: Cancelled requests
ro: Cereri anulate
